Repository: Besmerch123/party-bar
Catalog: lib/l10n/app_*.arb
Languages: uk

# navigationHome
source: Home
uk: Головна

# navigationExplore
source: Explore
uk: Каталог

# navigationParty
source: Party
uk: Вечірка

# navigationSettings
source: Settings
uk: Налаштування

# navigationProfile
source: Profile
uk: Профіль

source: Language
uk: Мова

source: Skip
uk: Пропустити

source: Get Started
uk: Почати

source: Next
uk: Далі

source: Previous
uk: Назад

# onboardingTitle1
source: Discover Amazing Cocktails
uk: Відкрийте для себе чудові коктейлі

# onboardingDescription1
source: Browse through hundreds of cocktail recipes with detailed instructions and ingredients.
uk: Переглядайте сотні рецептів коктейлів з детальними інструкціями та інгредієнтами.

# onboardingTitle2
source: Join Party Events
uk: Приєднуйтесь до вечірок

# onboardingDescription2
source: Enter party codes to join events and order cocktails directly from the host.
uk: Вводьте коди вечірок, щоб приєднатися до подій і замовляти коктейлі безпосередньо у хоста.

# onboardingTitle3
source: Create Your Own Parties
uk: Створюйте власні вечірки

# onboardingDescription3
source: Host your own cocktail parties and manage orders from your guests.
uk: Проводьте власні коктейльні вечірки та керуйте замовленнями ваших гостей.

# onboardingTitle4
source: Build Your Collection
uk: Створіть свою колекцію

# onboardingDescription4
source: Create personal cocktail bars and save your favorite recipes.
uk: Створюйте персональні коктейль-бари та зберігайте улюблені рецепти.

source: Loading...
uk: Завантаження...

source: Profile
uk: Профіль

source: Settings
uk: Налаштування

source: Authentication
uk: Автентифікація

source: Ingredients
uk: Інгредієнти

source: Equipment
uk: Обладнання

source: Preparation Steps
uk: Етапи приготування

source: Categories
uk: Категорії

# pageOfPages
source: {current} of {total}
uk: {current} з {total}

source: Explore Cocktails
uk: Досліджуйте коктейлі

source: Filter Cocktails
uk: Фільтрувати коктейлі

# filtersApply
source: Apply filters
uk: Застосувати фільтри

# filtersClear
source: Clear all
uk: Очистити всі

# searchCocktailsHint
source: Search cocktails...
uk: Шукати коктейлі...

source: Clear All
uk: Очистити все

# cocktailsFound
source: {count} cocktails found
uk: Знайдено {count} коктейлів

source: No cocktails found
uk: Коктейлі не знайдено

# tryAdjustingFilters
source: Try adjusting your search or filters
uk: Спробуйте змінити пошук або фільтри

source: Clear Filters
uk: Очистити фільтри

source: Error Loading Cocktails
uk: Помилка завантаження коктейлів

source: Unknown error
uk: Невідома помилка

source: Retry
uk: Повторити

# failedToRefresh
source: Failed to refresh: {error}
uk: Не вдалося оновити: {error}

source: Log in
uk: Увійти

source: Logout
uk: Вийти

# logoutSuccess
source: Successfully logged out
uk: Успішно вийшли з системи

# logoutError
source: Failed to logout. Please try again.
uk: Не вдалося вийти. Спробуйте ще раз.

source: Sign In
uk: Увійти

source: Sign Up
uk: Зареєструватися

# signInSuccess
source: Successfully signed in
uk: Успішно увійшли

# signUpSuccess
source: Account created successfully
uk: Обліковий запис створено успішно

source: Email
uk: Електронна пошта

# emailHint
source: Enter your email
uk: Введіть вашу електронну пошту

# emailRequired
source: Email is required
uk: Електронна пошта обов'язкова

# emailInvalid
source: Please enter a valid email
uk: Будь ласка, введіть дійсну електронну пошту

source: Password
uk: Пароль

# passwordHint
source: Enter your password
uk: Введіть ваш пароль

# passwordRequired
source: Password is required
uk: Пароль обов'язковий

# passwordTooShort
source: Password must be at least 6 characters
uk: Пароль має містити не менше 6 символів

source: Confirm Password
uk: Підтвердіть пароль

# confirmPasswordHint
source: Re-enter your password
uk: Введіть пароль ще раз

# confirmPasswordRequired
source: Please confirm your password
uk: Будь ласка, підтвердіть ваш пароль

source: Passwords do not match
uk: Паролі не збігаються

source: Create Account
uk: Створити обліковий запис

source: Welcome Back
uk: З поверненням

# signUpSubtitle
source: Create a new account to get started
uk: Створіть новий обліковий запис, щоб розпочати

# signInSubtitle
source: Sign in to your account
uk: Увійдіть у ваш обліковий запис

source: Or continue with
uk: Або продовжте з

source: Continue with Google
uk: Продовжити через Google

source: Authentication Required
uk: Потрібна автентифікація

# authenticationRequiredMessage
source: This feature is available only for authenticated users. Please sign in to continue.
uk: Ця функція доступна лише для автентифікованих користувачів. Будь ласка, увійдіть, щоб продовжити.

source: Sign In to Continue
uk: Увійти, щоб продовжити

source: Party Hub
uk: Центр вечірок

source: Welcome to PartyBar!
uk: Ласкаво просимо до PartyBar!

# joinOrCreateParty
source: Join a party or create your own cocktail experience
uk: Приєднайтесь до вечірки або створіть свій власний коктейльний досвід

source: Join Party
uk: Приєднатися до вечірки

# joinPartySubtitle
source: Enter a party code to join the fun
uk: Введіть код вечірки, щоб приєднатися до веселощів

source: Create Party
uk: Створити вечірку

# createPartySubtitle
source: Host your own cocktail party
uk: Організуйте власну коктейльну вечірку

# partyQuickInfo
source: Hosts can manage orders and guests can browse cocktails in real-time!
uk: Хости можуть керувати замовленнями, а гості переглядати коктейлі в режимі реального часу!

# createPartyTitle
source: Create Party
uk: Створити вечірку

source: Create Your Party
uk: Створіть свою вечірку

# createPartyDescription
source: Set up your cocktail party and invite guests
uk: Налаштуйте коктейльну вечірку та запросіть гостей

source: Party Details
uk: Деталі вечірки

# partyNameLabel
source: Party Name *
uk: Назва вечірки *

# partyNameHint
source: e.g., Sarah's Birthday Bash
uk: напр., День народження Сари

# partyDescriptionLabel
source: Description (Optional)
uk: Опис (необов'язково)

# partyDescriptionHint
source: Tell guests about your party...
uk: Розкажіть гостям про вашу вечірку...

source: Select Available Cocktails *
uk: Виберіть доступні коктейлі *

# selectedCount
source: {count} selected
uk: Обрано: {count}

source: All Classic
uk: Всі класичні

# tikiAndFrozen
source: Tiki & Frozen
uk: Тікі та заморожені

# createPartyButton
source: Create Party
uk: Створити вечірку

# pleaseEnterPartyName
source: Please enter a party name
uk: Будь ласка, введіть назву вечірки

# pleaseSelectCocktail
source: Please select at least one cocktail
uk: Будь ласка, виберіть хоча б один коктейль

source: Cocktail
uk: Коктейль

source: My Hosted Parties
uk: Мої вечірки

source: View My Parties
uk: Переглянути мої вечірки

# noHostedParties
source: You haven't hosted any parties yet
uk: Ви ще не організували жодної вечірки

# createFirstParty
source: Create your first party to get started!
uk: Створіть свою першу вечірку, щоб почати!

source: View Details
uk: Переглянути деталі

source: Invitation Code
uk: Код запрошення

source: Share Code
uk: Поділитися кодом

source: Copy Code
uk: Копіювати код

# codeCopied
source: Code copied to clipboard!
uk: Код скопійовано

source: Party Cocktails
uk: Коктейлі вечірки

source: Add Cocktails
uk: Додати коктейлі

# removeCocktail
source: Remove
uk: Видалити коктейль

# noCocktailsAdded
source: No cocktails added yet
uk: Коктейлі не додані

source: Edit Party Info
uk: Редагувати інформацію про вечірку

source: Save Changes
uk: Зберегти зміни

source: Cancel
uk: Скасувати

source: Party Status
uk: Статус вечірки

source: Start Party
uk: Почати вечірку

source: Pause Party
uk: Призупинити вечірку

source: Resume Party
uk: Відновити вечірку

source: End Party
uk: Завершити вечірку

# partyActive
source: Active
uk: Вечірка активна

# partyPaused
source: Paused
uk: Вечірка призупинена

# partyEnded
source: Ended
uk: Вечірка завершена

# partyIdle
source: Not started
uk: Не розпочата

# confirmEndParty
source: Are you sure you want to end the party?
uk: Підтвердити завершення вечірки

# confirmEndPartyMessage
source: This action cannot be undone. All party data will be archived.
uk: Ви впевнені, що хочете завершити цю вечірку? Цю дію не можна скасувати.

source: Go to Host Dashboard
uk: Перейти до панелі господаря

source: Go to Party Menu
uk: Перейти до меню вечірки

# partyAdminPanel
source: Party Admin
uk: Панель адміністратора вечірки

# cocktailsSelected
source: {count, plural, =1{1 cocktail selected} other{{count} cocktails selected}}
uk: {count, plural, =1{Обрано 1 коктейль} few{Обрано {count} коктейлі} other{Обрано {count} коктейлів}}

source: Select Cocktails
uk: Оберіть коктейлі

# addSelectedCocktails
source: {count, plural, =1{Save 1 Cocktail} other{Save {count} Cocktails}}
uk: {count, plural, =1{Зберегти 1 коктейль} few{Зберегти {count} коктейлі} other{Зберегти {count} коктейлів}}

# cocktailsAlreadyAdded
source: All selected cocktails are already added
uk: Всі обрані коктейлі вже додані

# cocktailsAddedSuccess
source: {count, plural, =1{1 cocktail added successfully} other{{count} cocktails added successfully}}
uk: {count, plural, =1{1 коктейль успішно додано} few{{count} коктейлі успішно додано} other{{count} коктейлів успішно додано}}

# failedToAddCocktails
source: Failed to add cocktails: {error}
uk: Не вдалося додати коктейлі: {error}

source: No pending orders
uk: Немає очікуючих замовлень

# ordersWillAppear
source: Orders will appear here as guests place them
uk: Замовлення з'являться тут, коли гості їх розмістять

source: Unknown Cocktail
uk: Невідомий коктейль

# forGuest
source: For: {guestName}
uk: Для: {guestName}

# ordered
source: Ordered: {time}
uk: Замовлено: {time}

source: Just now
uk: Щойно

# minutesAgo
source: {minutes}m ago
uk: {minutes}хв тому

# hoursAgo
source: {hours}h ago
uk: {hours}год тому

source: Start Preparing
uk: Почати готувати

source: Mark Ready
uk: Позначити готовим

source: Mark Delivered
uk: Позначити доставленим

source: New Orders
uk: Нові замовлення

source: Preparing
uk: Готується

source: Ready for Pickup
uk: Готово до видачі

source: Orders
uk: Замовлення

source: Orders ({count})
uk: Замовлення ({count})

source: Stats
uk: Статистика

source: Menu
uk: Меню

source: Total Orders
uk: Всього замовлень

source: Completed
uk: Виконано

source: Pending
uk: Очікує

source: Active Time
uk: Час активності

source: Party Overview
uk: Огляд вечірки

source: Popular Cocktails
uk: Популярні коктейлі

source: No orders yet
uk: Ще немає замовлень

# availableCocktails
source: Available Cocktails ({count})
uk: Доступні коктейлі ({count})

source: No cocktails available
uk: Немає доступних коктейлів

# addCocktailsToMenu
source: Add cocktails to the party menu
uk: Додайте коктейлі до меню вечірки

# errorLoadingCocktailsList
source: Error loading cocktails
uk: Помилка завантаження коктейлів

# partyCopiedToClipboard
source: Party code copied to clipboard!
uk: Код вечірки скопійовано!

source: Party QR Code
uk: QR-код вечірки

source: QR CODE (Mock)
uk: QR-КОД (Макет)

# code
source: Code: {code}
uk: Код: {code}

source: Close
uk: Закрити

source: Party resumed
uk: Вечірку відновлено

# partyPausedMessage
source: Party paused
uk: Вечірку призупинено

# failedToUpdateOrder
source: Failed to update order: {error}
uk: Не вдалося оновити замовлення: {error}

# failedToUpdatePartyStatus
source: Failed to update party status: {error}
uk: Не вдалося оновити статус вечірки: {error}

# orderMarkedAs
source: {cocktail} for {guest} marked as {status}
uk: {cocktail} для {guest} позначено як {status}

# errorWithMessage
source: Error: {message}
uk: Помилка: {message}

# joinPartyTitle
source: Join Party
uk: Приєднатися до вечірки

source: Join the Party!
uk: Приєднайтеся до вечірки!

# enterPartyCodeToOrder
source: Enter the party code to start ordering cocktails
uk: Введіть код вечірки, щоб почати замовляти коктейлі

source: Your Name
uk: Ваше ім'я

source: Enter your name
uk: Введіть ваше ім'я

source: Party Code
uk: Код вечірки

# enterPartyCode
source: Enter 6-digit party code
uk: Введіть 6-значний код вечірки

source: Scan QR Code
uk: Сканувати QR-код

# qrCodeScannedSuccess
source: QR Code scanned successfully!
uk: QR-код успішно відсканований!

# pleaseEnterNameAndCode
source: Please enter both party code and your name
uk: Будь ласка, введіть код вечірки та ваше ім'я

# askHostForCode
source: Ask the party host for the 6-digit party code or scan their QR code
uk: Попросіть господаря вечірки надати 6-значний код або відскануйте їхній QR-код

# partyNotFound
source: Party not found. Please check the code and try again.
uk: Вечірку не знайдено. Перевірте код і спробуйте ще раз.

source: Joining party...
uk: Приєднання до вечірки...

source: Order Cocktail
uk: Замовити коктейль

source: Special Requests
uk: Особливі побажання

# specialRequestsHint
source: e.g., extra lime, no sugar...
uk: наприклад, більше лайма, без цукру...

source: (optional)
uk: (необов'язково)

# orderConfirmation
source: Order {cocktailName}
uk: Замовити {cocktailName}

# orderConfirmMessage
source: Are you sure you want to order {cocktailName}?
uk: Ви впевнені, що хочете замовити {cocktailName}?

# cocktailOrderedSuccess
source: {cocktailName} ordered successfully!
uk: {cocktailName} успішно замовлено!

# failedToOrderCocktail
source: Failed to order cocktail: {error}
uk: Не вдалося замовити коктейль: {error}

source: My Orders
uk: Мої замовлення

source: My Stats
uk: Моя статистика

source: Orders Placed
uk: Зроблено замовлень

source: Cocktails Tried
uk: Спробовано коктейлів

source: Favorite Cocktail
uk: Улюблений коктейль

source: No favorite yet
uk: Ще немає улюбленого

# youHaventOrderedYet
source: You haven't ordered any cocktails yet
uk: Ви ще не замовили жодного коктейлю

# startOrderingFromMenu
source: Start ordering from the menu!
uk: Почніть замовляти з меню!

source: Already tried
uk: Вже спробували

# welcome
source: Welcome, {name}!
uk: Ласкаво просимо, {name}!

source: View Recipe
uk: Переглянути рецепт

source: Order Now
uk: Замовити зараз
